# CloudPath Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelPath..::..CloudPath Property
ModelPath Class See Also
---
Whether this path represents a path on an Autodesk server such as BIM360.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool CloudPath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CloudPath As Boolean
	Get
```

Visual C++
---
```text
public:
property bool CloudPath {
	bool get ();
}
```

# See Also
ModelPath Class
Autodesk.Revit.DB Namespace